Tekla.Structures.Plugins.PropertyPane.Catalog
The catalog property enum.

Tekla.Structures.Plugins.PropertyPane.Catalog.None
The None.

Tekla.Structures.Plugins.PropertyPane.Catalog.Profile
The profile.

Tekla.Structures.Plugins.PropertyPane.Catalog.Shape
The shape.

Tekla.Structures.Plugins.PropertyPane.Catalog.Material
The material.

Tekla.Structures.Plugins.PropertyPane.Catalog.Bolt
The bolt.

Tekla.Structures.Plugins.PropertyPane.Catalog.RebarGrade
The rebar grade.